<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"4726fd35d457390e7d5eb8b9f74a4a44c52828cb95a7eb0fd0fe5d1ebab47c53","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #679 at https://github.com/cal-itp/data-infra/actions/runs/17925706317","plan_out_hash":"8b75c8305f952e6280c3a00e19027b38c850bd5a52bb31435e560981f4692f00","plan_hash":"27bcc102e2e6ff835a61aa507d364560cafe8d0e211cdec4860ee4406fa8d574","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 0 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "jt477Q==" -> (known after apply)
!~      detect_md5hash      = "Z2vrtASxHLJuhHV3ixiaHQ==" -> "different hash"
!~      generation          = 1758311274485789 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "Z2vrtASxHLJuhHV3ixiaHQ==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "qWGFow==" -> (known after apply)
!~      detect_md5hash      = "9++V7UQTvHJxJ90vsnG18A==" -> "different hash"
!~      generation          = 1758311276222460 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "9++V7UQTvHJxJ90vsnG18A==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #679](https://github.com/cal-itp/data-infra/actions/runs/17925706317)